virtualabs/cutcutgo/cutcutgo.X/src/packs/ATSAMA5D27CD1G_DFP/pio/sama5d27cd1g.h
#define PIN_PB5D_QSPI1_SCK                         _L_(37)      /**< QSPI1 signal: QSPI1_SCK on PB5 mux D */
#define MUX_PB5D_QSPI1_SCK                         _L_(3)       /**< QSPI1 signal line function value: QSPI1_SCK */
#define PIO_PB5D_QSPI1_SCK                         (_U_(1) << 5) /**< QSPI1 signal: QSPI1_SCK */
#define PIN_PB14E_QSPI1_SCK                        _L_(46)      /**< QSPI1 signal: QSPI1_SCK on PB14 mux E */
#define MUX_PB14E_QSPI1_SCK                        _L_(4)       /**< QSPI1 signal line function value: QSPI1_SCK */
#define PIO_PB14E_QSPI1_SCK                        (_U_(1) << 14) /**< QSPI1 signal: QSPI1_SCK */
/* ========== PIO definition for SDMMC0 peripheral ========== */
#define PIN_PA11A_SDMMC0_1V8SEL                    _L_(11)      /**< SDMMC0 signal: SDMMC0_1V8SEL on PA11 mux A */
#define MUX_PA11A_SDMMC0_1V8SEL                    _L_(0)       /**< SDMMC0 signal line function value: SDMMC0_1V8SEL */
#define PIO_PA11A_SDMMC0_1V8SEL                    (_U_(1) << 11) /**< SDMMC0 signal: SDMMC0_1V8SEL */
#define PIN_PA13A_SDMMC0_CD                        _L_(13)      /**< SDMMC0 signal: SDMMC0_CD on PA13 mux A */
#define MUX_PA13A_SDMMC0_CD                        _L_(0)       /**< SDMMC0 signal line function value: SDMMC0_CD */
#define PIO_PA13A_SDMMC0_CD                        (_U_(1) << 13) /**< SDMMC0 signal: SDMMC0_CD */
#define PIN_PA0A_SDMMC0_CK                         _L_(0)       /**< SDMMC0 signal: SDMMC0_CK on PA0 mux A */
#define MUX_PA0A_SDMMC0_CK                         _L_(0)       /**< SDMMC0 signal line function value: SDMMC0_CK */
#define PIO_PA0A_SDMMC0_CK                         (_U_(1) << 0) /**< SDMMC0 signal: SDMMC0_CK */
#define PIN_PA1A_SDMMC0_CMD                        _L_(1)       /**< SDMMC0 signal: SDMMC0_CMD on PA1 mux A */
#define MUX_PA1A_SDMMC0_CMD                        _L_(0)       /**< SDMMC0 signal line function value: SDMMC0_CMD */
#define PIO_PA1A_SDMMC0_CMD                        (_U_(1) << 1) /**< SDMMC0 signal: SDMMC0_CMD */
#define PIN_PA2A_SDMMC0_DAT0                       _L_(2)       /**< SDMMC0 signal: SDMMC0_DAT0 on PA2 mux A */
#define MUX_PA2A_SDMMC0_DAT0                       _L_(0)       /**< SDMMC0 signal line function value: SDMMC0_DAT0 */
#define PIO_PA2A_SDMMC0_DAT0                       (_U_(1) << 2) /**< SDMMC0 signal: SDMMC0_DAT0 */
#define PIN_PA3A_SDMMC0_DAT1                       _L_(3)       /**< SDMMC0 signal: SDMMC0_DAT1 on PA3 mux A */
#define MUX_PA3A_SDMMC0_DAT1                       _L_(0)       /**< SDMMC0 signal line function value: SDMMC0_DAT1 */
#define PIO_PA3A_SDMMC0_DAT1                       (_U_(1) << 3) /**< SDMMC0 signal: SDMMC0_DAT1 */
#define PIN_PA4A_SDMMC0_DAT2                       _L_(4)       /**< SDMMC0 signal: SDMMC0_DAT2 on PA4 mux A */
#define MUX_PA4A_SDMMC0_DAT2                       _L_(0)       /**< SDMMC0 signal line function value: SDMMC0_DAT2 */
#define PIO_PA4A_SDMMC0_DAT2                       (_U_(1) << 4) /**< SDMMC0 signal: SDMMC0_DAT2 */
#define PIN_PA5A_SDMMC0_DAT3                       _L_(5)       /**< SDMMC0 signal: SDMMC0_DAT3 on PA5 mux A */
#define MUX_PA5A_SDMMC0_DAT3                       _L_(0)       /**< SDMMC0 signal line function value: SDMMC0_DAT3 */
#define PIO_PA5A_SDMMC0_DAT3                       (_U_(1) << 5) /**< SDMMC0 signal: SDMMC0_DAT3 */
#define PIN_PA6A_SDMMC0_DAT4                       _L_(6)       /**< SDMMC0 signal: SDMMC0_DAT4 on PA6 mux A */
#define MUX_PA6A_SDMMC0_DAT4                       _L_(0)       /**< SDMMC0 signal line function value: SDMMC0_DAT4 */
#define PIO_PA6A_SDMMC0_DAT4                       (_U_(1) << 6) /**< SDMMC0 signal: SDMMC0_DAT4 */
#define PIN_PA7A_SDMMC0_DAT5                       _L_(7)       /**< SDMMC0 signal: SDMMC0_DAT5 on PA7 mux A */
#define MUX_PA7A_SDMMC0_DAT5                       _L_(0)       /**< SDMMC0 signal line function value: SDMMC0_DAT5 */
#define PIO_PA7A_SDMMC0_DAT5                       (_U_(1) << 7) /**< SDMMC0 signal: SDMMC0_DAT5 */
#define PIN_PA8A_SDMMC0_DAT6                       _L_(8)       /**< SDMMC0 signal: SDMMC0_DAT6 on PA8 mux A */
#define MUX_PA8A_SDMMC0_DAT6                       _L_(0)       /**< SDMMC0 signal line function value: SDMMC0_DAT6 */
#define PIO_PA8A_SDMMC0_DAT6                       (_U_(1) << 8) /**< SDMMC0 signal: SDMMC0_DAT6 */
#define PIN_PA9A_SDMMC0_DAT7                       _L_(9)       /**< SDMMC0 signal: SDMMC0_DAT7 on PA9 mux A */
#define MUX_PA9A_SDMMC0_DAT7                       _L_(0)       /**< SDMMC0 signal line function value: SDMMC0_DAT7 */
#define PIO_PA9A_SDMMC0_DAT7                       (_U_(1) << 9) /**< SDMMC0 signal: SDMMC0_DAT7 */
#define PIN_PA10A_SDMMC0_RSTN                      _L_(10)      /**< SDMMC0 signal: SDMMC0_RSTN on PA10 mux A */
#define MUX_PA10A_SDMMC0_RSTN                      _L_(0)       /**< SDMMC0 signal line function value: SDMMC0_RSTN */
#define PIO_PA10A_SDMMC0_RSTN                      (_U_(1) << 10) /**< SDMMC0 signal: SDMMC0_RSTN */
#define PIN_PA12A_SDMMC0_WP                        _L_(12)      /**< SDMMC0 signal: SDMMC0_WP on PA12 mux A */
#define MUX_PA12A_SDMMC0_WP                        _L_(0)       /**< SDMMC0 signal line function value: SDMMC0_WP */
#define PIO_PA12A_SDMMC0_WP                        (_U_(1) << 12) /**< SDMMC0 signal: SDMMC0_WP */
/* ========== PIO definition for SDMMC1 peripheral ========== */
#define PIN_PA30E_SDMMC1_CD                        _L_(30)      /**< SDMMC1 signal: SDMMC1_CD on PA30 mux E */
#define MUX_PA30E_SDMMC1_CD                        _L_(4)       /**< SDMMC1 signal line function value: SDMMC1_CD */
#define PIO_PA30E_SDMMC1_CD                        (_U_(1) << 30) /**< SDMMC1 signal: SDMMC1_CD */
#define PIN_PA22E_SDMMC1_CK                        _L_(22)      /**< SDMMC1 signal: SDMMC1_CK on PA22 mux E */
#define MUX_PA22E_SDMMC1_CK                        _L_(4)       /**< SDMMC1 signal line function value: SDMMC1_CK */
#define PIO_PA22E_SDMMC1_CK                        (_U_(1) << 22) /**< SDMMC1 signal: SDMMC1_CK */
#define PIN_PA28E_SDMMC1_CMD                       _L_(28)      /**< SDMMC1 signal: SDMMC1_CMD on PA28 mux E */
#define MUX_PA28E_SDMMC1_CMD                       _L_(4)       /**< SDMMC1 signal line function value: SDMMC1_CMD */
#define PIO_PA28E_SDMMC1_CMD                       (_U_(1) << 28) /**< SDMMC1 signal: SDMMC1_CMD */
#define PIN_PA18E_SDMMC1_DAT0                      _L_(18)      /**< SDMMC1 signal: SDMMC1_DAT0 on PA18 mux E */
#define MUX_PA18E_SDMMC1_DAT0                      _L_(4)       /**< SDMMC1 signal line function value: SDMMC1_DAT0 */
#define PIO_PA18E_SDMMC1_DAT0                      (_U_(1) << 18) /**< SDMMC1 signal: SDMMC1_DAT0 */
#define PIN_PA19E_SDMMC1_DAT1                      _L_(19)      /**< SDMMC1 signal: SDMMC1_DAT1 on PA19 mux E */
#define MUX_PA19E_SDMMC1_DAT1                      _L_(4)       /**< SDMMC1 signal line function value: SDMMC1_DAT1 */
#define PIO_PA19E_SDMMC1_DAT1                      (_U_(1) << 19) /**< SDMMC1 signal: SDMMC1_DAT1 */
#define PIN_PA20E_SDMMC1_DAT2                      _L_(20)      /**< SDMMC1 signal: SDMMC1_DAT2 on PA20 mux E */
#define MUX_PA20E_SDMMC1_DAT2                      _L_(4)       /**< SDMMC1 signal line function value: SDMMC1_DAT2 */
#define PIO_PA20E_SDMMC1_DAT2                      (_U_(1) << 20) /**< SDMMC1 signal: SDMMC1_DAT2 */
#define PIN_PA21E_SDMMC1_DAT3                      _L_(21)      /**< SDMMC1 signal: SDMMC1_DAT3 on PA21 mux E */
#define MUX_PA21E_SDMMC1_DAT3                      _L_(4)       /**< SDMMC1 signal line function value: SDMMC1_DAT3 */
#define PIO_PA21E_SDMMC1_DAT3                      (_U_(1) << 21) /**< SDMMC1 signal: SDMMC1_DAT3 */
#define PIN_PA27E_SDMMC1_RSTN                      _L_(27)      /**< SDMMC1 signal: SDMMC1_RSTN on PA27 mux E */
#define MUX_PA27E_SDMMC1_RSTN                      _L_(4)       /**< SDMMC1 signal line function value: SDMMC1_RSTN */
#define PIO_PA27E_SDMMC1_RSTN                      (_U_(1) << 27) /**< SDMMC1 signal: SDMMC1_RSTN */
#define PIN_PA29E_SDMMC1_WP                        _L_(29)      /**< SDMMC1 signal: SDMMC1_WP on PA29 mux E */
#define MUX_PA29E_SDMMC1_WP                        _L_(4)       /**< SDMMC1 signal line function value: SDMMC1_WP */
#define PIO_PA29E_SDMMC1_WP                        (_U_(1) << 29) /**< SDMMC1 signal: SDMMC1_WP */
/* ========== PIO definition for SMC peripheral ========== */
#define PIN_PB12B_SMC_A1                           _L_(44)      /**< SMC signal: SMC_A1 on PB12 mux B */
#define MUX_PB12B_SMC_A1                           _L_(1)       /**< SMC signal line function value: SMC_A1 */
#define PIO_PB12B_SMC_A1                           (_U_(1) << 12) /**< SMC signal: SMC_A1 */
#define PIN_PC12C_SMC_A1                           _L_(76)      /**< SMC signal: SMC_A1 on PC12 mux C */
#define MUX_PC12C_SMC_A1                           _L_(2)       /**< SMC signal line function value: SMC_A1 */
#define PIO_PC12C_SMC_A1                           (_U_(1) << 12) /**< SMC signal: SMC_A1 */
#define PIN_PB13B_SMC_A2                           _L_(45)      /**< SMC signal: SMC_A2 on PB13 mux B */
#define MUX_PB13B_SMC_A2                           _L_(1)       /**< SMC signal line function value: SMC_A2 */
#define PIO_PB13B_SMC_A2                           (_U_(1) << 13) /**< SMC signal: SMC_A2 */
#define PIN_PC13C_SMC_A2                           _L_(77)      /**< SMC signal: SMC_A2 on PC13 mux C */
#define MUX_PC13C_SMC_A2                           _L_(2)       /**< SMC signal line function value: SMC_A2 */
#define PIO_PC13C_SMC_A2                           (_U_(1) << 13) /**< SMC signal: SMC_A2 */
#define PIN_PB14B_SMC_A3                           _L_(46)      /**< SMC signal: SMC_A3 on PB14 mux B */
#define MUX_PB14B_SMC_A3                           _L_(1)       /**< SMC signal line function value: SMC_A3 */
#define PIO_PB14B_SMC_A3                           (_U_(1) << 14) /**< SMC signal: SMC_A3 */
#define PIN_PC14C_SMC_A3                           _L_(78)      /**< SMC signal: SMC_A3 on PC14 mux C */
#define MUX_PC14C_SMC_A3                           _L_(2)       /**< SMC signal line function value: SMC_A3 */
#define PIO_PC14C_SMC_A3                           (_U_(1) << 14) /**< SMC signal: SMC_A3 */
#define PIN_PB15B_SMC_A4                           _L_(47)      /**< SMC signal: SMC_A4 on PB15 mux B */
#define MUX_PB15B_SMC_A4                           _L_(1)       /**< SMC signal line function value: SMC_A4 */
#define PIO_PB15B_SMC_A4                           (_U_(1) << 15) /**< SMC signal: SMC_A4 */
#define PIN_PC15C_SMC_A4                           _L_(79)      /**< SMC signal: SMC_A4 on PC15 mux C */
#define MUX_PC15C_SMC_A4                           _L_(2)       /**< SMC signal line function value: SMC_A4 */
#define PIO_PC15C_SMC_A4                           (_U_(1) << 15) /**< SMC signal: SMC_A4 */
#define PIN_PB16B_SMC_A5                           _L_(48)      /**< SMC signal: SMC_A5 on PB16 mux B */
#define MUX_PB16B_SMC_A5                           _L_(1)       /**< SMC signal line function value: SMC_A5 */
#define PIO_PB16B_SMC_A5                           (_U_(1) << 16) /**< SMC signal: SMC_A5 */
#define PIN_PC16C_SMC_A5                           _L_(80)      /**< SMC signal: SMC_A5 on PC16 mux C */
#define MUX_PC16C_SMC_A5                           _L_(2)       /**< SMC signal line function value: SMC_A5 */
#define PIO_PC16C_SMC_A5                           (_U_(1) << 16) /**< SMC signal: SMC_A5 */
#define PIN_PB17B_SMC_A6                           _L_(49)      /**< SMC signal: SMC_A6 on PB17 mux B */
#define MUX_PB17B_SMC_A6                           _L_(1)       /**< SMC signal line function value: SMC_A6 */
#define PIO_PB17B_SMC_A6                           (_U_(1) << 17) /**< SMC signal: SMC_A6 */
#define PIN_PC17C_SMC_A6                           _L_(81)      /**< SMC signal: SMC_A6 on PC17 mux C */
#define MUX_PC17C_SMC_A6                           _L_(2)       /**< SMC signal line function value: SMC_A6 */
#define PIO_PC17C_SMC_A6                           (_U_(1) << 17) /**< SMC signal: SMC_A6 */
#define PIN_PB18B_SMC_A7                           _L_(50)      /**< SMC signal: SMC_A7 on PB18 mux B */
#define MUX_PB18B_SMC_A7                           _L_(1)       /**< SMC signal line function value: SMC_A7 */
#define PIO_PB18B_SMC_A7                           (_U_(1) << 18) /**< SMC signal: SMC_A7 */
#define PIN_PC18C_SMC_A7                           _L_(82)      /**< SMC signal: SMC_A7 on PC18 mux C */
#define MUX_PC18C_SMC_A7                           _L_(2)       /**< SMC signal line function value: SMC_A7 */
#define PIO_PC18C_SMC_A7                           (_U_(1) << 18) /**< SMC signal: SMC_A7 */
#define PIN_PB19B_SMC_A8                           _L_(51)      /**< SMC signal: SMC_A8 on PB19 mux B */
#define MUX_PB19B_SMC_A8                           _L_(1)       /**< SMC signal line function value: SMC_A8 */
#define PIO_PB19B_SMC_A8                           (_U_(1) << 19) /**< SMC signal: SMC_A8 */
#define PIN_PC19C_SMC_A8                           _L_(83)      /**< SMC signal: SMC_A8 on PC19 mux C */
#define MUX_PC19C_SMC_A8                           _L_(2)       /**< SMC signal line function value: SMC_A8 */
#define PIO_PC19C_SMC_A8                           (_U_(1) << 19) /**< SMC signal: SMC_A8 */
#define PIN_PB20B_SMC_A9                           _L_(52)      /**< SMC signal: SMC_A9 on PB20 mux B */
#define MUX_PB20B_SMC_A9                           _L_(1)       /**< SMC signal line function value: SMC_A9 */
#define PIO_PB20B_SMC_A9                           (_U_(1) << 20) /**< SMC signal: SMC_A9 */
#define PIN_PC20C_SMC_A9                           _L_(84)      /**< SMC signal: SMC_A9 on PC20 mux C */
#define MUX_PC20C_SMC_A9                           _L_(2)       /**< SMC signal line function value: SMC_A9 */
#define PIO_PC20C_SMC_A9                           (_U_(1) << 20) /**< SMC signal: SMC_A9 */
#define PIN_PB21B_SMC_A10                          _L_(53)      /**< SMC signal: SMC_A10 on PB21 mux B */
#define MUX_PB21B_SMC_A10                          _L_(1)       /**< SMC signal line function value: SMC_A10 */
#define PIO_PB21B_SMC_A10                          (_U_(1) << 21) /**< SMC signal: SMC_A10 */
#define PIN_PC21C_SMC_A10                          _L_(85)      /**< SMC signal: SMC_A10 on PC21 mux C */
#define MUX_PC21C_SMC_A10                          _L_(2)       /**< SMC signal line function value: SMC_A10 */
#define PIO_PC21C_SMC_A10                          (_U_(1) << 21) /**< SMC signal: SMC_A10 */
#define PIN_PB22B_SMC_A11                          _L_(54)      /**< SMC signal: SMC_A11 on PB22 mux B */
#define MUX_PB22B_SMC_A11                          _L_(1)       /**< SMC signal line function value: SMC_A11 */
#define PIO_PB22B_SMC_A11                          (_U_(1) << 22) /**< SMC signal: SMC_A11 */
#define PIN_PC22C_SMC_A11                          _L_(86)      /**< SMC signal: SMC_A11 on PC22 mux C */
#define MUX_PC22C_SMC_A11                          _L_(2)       /**< SMC signal line function value: SMC_A11 */
#define PIO_PC22C_SMC_A11                          (_U_(1) << 22) /**< SMC signal: SMC_A11 */
#define PIN_PB23B_SMC_A12                          _L_(55)      /**< SMC signal: SMC_A12 on PB23 mux B */
#define MUX_PB23B_SMC_A12                          _L_(1)       /**< SMC signal line function value: SMC_A12 */
#define PIO_PB23B_SMC_A12                          (_U_(1) << 23) /**< SMC signal: SMC_A12 */
#define PIN_PC23C_SMC_A12                          _L_(87)      /**< SMC signal: SMC_A12 on PC23 mux C */
#define MUX_PC23C_SMC_A12                          _L_(2)       /**< SMC signal line function value: SMC_A12 */
#define PIO_PC23C_SMC_A12                          (_U_(1) << 23) /**< SMC signal: SMC_A12 */
#define PIN_PB24B_SMC_A13                          _L_(56)      /**< SMC signal: SMC_A13 on PB24 mux B */
#define MUX_PB24B_SMC_A13                          _L_(1)       /**< SMC signal line function value: SMC_A13 */
#define PIO_PB24B_SMC_A13                          (_U_(1) << 24) /**< SMC signal: SMC_A13 */
#define PIN_PC24C_SMC_A13                          _L_(88)      /**< SMC signal: SMC_A13 on PC24 mux C */
#define MUX_PC24C_SMC_A13                          _L_(2)       /**< SMC signal line function value: SMC_A13 */
#define PIO_PC24C_SMC_A13                          (_U_(1) << 24) /**< SMC signal: SMC_A13 */
#define PIN_PB25B_SMC_A14                          _L_(57)      /**< SMC signal: SMC_A14 on PB25 mux B */
#define MUX_PB25B_SMC_A14                          _L_(1)       /**< SMC signal line function value: SMC_A14 */
#define PIO_PB25B_SMC_A14                          (_U_(1) << 25) /**< SMC signal: SMC_A14 */
#define PIN_PC25C_SMC_A14                          _L_(89)      /**< SMC signal: SMC_A14 on PC25 mux C */
#define MUX_PC25C_SMC_A14                          _L_(2)       /**< SMC signal line function value: SMC_A14 */
#define PIO_PC25C_SMC_A14                          (_U_(1) << 25) /**< SMC signal: SMC_A14 */
#define PIN_PB26B_SMC_A15                          _L_(58)      /**< SMC signal: SMC_A15 on PB26 mux B */
#define MUX_PB26B_SMC_A15                          _L_(1)       /**< SMC signal line function value: SMC_A15 */
#define PIO_PB26B_SMC_A15                          (_U_(1) << 26) /**< SMC signal: SMC_A15 */
#define PIN_PC26C_SMC_A15                          _L_(90)      /**< SMC signal: SMC_A15 on PC26 mux C */
#define MUX_PC26C_SMC_A15                          _L_(2)       /**< SMC signal line function value: SMC_A15 */
#define PIO_PC26C_SMC_A15                          (_U_(1) << 26) /**< SMC signal: SMC_A15 */
#define PIN_PB27B_SMC_A16                          _L_(59)      /**< SMC signal: SMC_A16 on PB27 mux B */
#define MUX_PB27B_SMC_A16                          _L_(1)       /**< SMC signal line function value: SMC_A16 */
#define PIO_PB27B_SMC_A16                          (_U_(1) << 27) /**< SMC signal: SMC_A16 */
#define PIN_PC27C_SMC_A16                          _L_(91)      /**< SMC signal: SMC_A16 on PC27 mux C */
#define MUX_PC27C_SMC_A16                          _L_(2)       /**< SMC signal line function value: SMC_A16 */
#define PIO_PC27C_SMC_A16                          (_U_(1) << 27) /**< SMC signal: SMC_A16 */
#define PIN_PB28B_SMC_A17                          _L_(60)      /**< SMC signal: SMC_A17 on PB28 mux B */
#define MUX_PB28B_SMC_A17                          _L_(1)       /**< SMC signal line function value: SMC_A17 */
#define PIO_PB28B_SMC_A17                          (_U_(1) << 28) /**< SMC signal: SMC_A17 */
#define PIN_PC28C_SMC_A17                          _L_(92)      /**< SMC signal: SMC_A17 on PC28 mux C */
#define MUX_PC28C_SMC_A17                          _L_(2)       /**< SMC signal line function value: SMC_A17 */
#define PIO_PC28C_SMC_A17                          (_U_(1) << 28) /**< SMC signal: SMC_A17 */
#define PIN_PB29B_SMC_A18                          _L_(61)      /**< SMC signal: SMC_A18 on PB29 mux B */
#define MUX_PB29B_SMC_A18                          _L_(1)       /**< SMC signal line function value: SMC_A18 */
#define PIO_PB29B_SMC_A18                          (_U_(1) << 29) /**< SMC signal: SMC_A18 */
#define PIN_PC29C_SMC_A18                          _L_(93)      /**< SMC signal: SMC_A18 on PC29 mux C */
#define MUX_PC29C_SMC_A18                          _L_(2)       /**< SMC signal line function value: SMC_A18 */
#define PIO_PC29C_SMC_A18                          (_U_(1) << 29) /**< SMC signal: SMC_A18 */
#define PIN_PB30B_SMC_A19                          _L_(62)      /**< SMC signal: SMC_A19 on PB30 mux B */
#define MUX_PB30B_SMC_A19                          _L_(1)       /**< SMC signal line function value: SMC_A19 */
#define PIO_PB30B_SMC_A19                          (_U_(1) << 30) /**< SMC signal: SMC_A19 */
#define PIN_PC30C_SMC_A19                          _L_(94)      /**< SMC signal: SMC_A19 on PC30 mux C */
#define MUX_PC30C_SMC_A19                          _L_(2)       /**< SMC signal line function value: SMC_A19 */
#define PIO_PC30C_SMC_A19                          (_U_(1) << 30) /**< SMC signal: SMC_A19 */
#define PIN_PB31B_SMC_A20                          _L_(63)      /**< SMC signal: SMC_A20 on PB31 mux B */
#define MUX_PB31B_SMC_A20                          _L_(1)       /**< SMC signal line function value: SMC_A20 */
#define PIO_PB31B_SMC_A20                          (_U_(1) << 31) /**< SMC signal: SMC_A20 */
#define PIN_PC31C_SMC_A20                          _L_(95)      /**< SMC signal: SMC_A20 on PC31 mux C */
#define MUX_PC31C_SMC_A20                          _L_(2)       /**< SMC signal line function value: SMC_A20 */
#define PIO_PC31C_SMC_A20                          (_U_(1) << 31) /**< SMC signal: SMC_A20 */
#define PIN_PC0B_SMC_A23                           _L_(64)      /**< SMC signal: SMC_A23 on PC0 mux B */
#define MUX_PC0B_SMC_A23                           _L_(1)       /**< SMC signal line function value: SMC_A23 */
#define PIO_PC0B_SMC_A23                           (_U_(1) << 0) /**< SMC signal: SMC_A23 */
#define PIN_PD0C_SMC_A23                           _L_(96)      /**< SMC signal: SMC_A23 on PD0 mux C */
#define MUX_PD0C_SMC_A23                           _L_(2)       /**< SMC signal line function value: SMC_A23 */
#define PIO_PD0C_SMC_A23                           (_U_(1) << 0) /**< SMC signal: SMC_A23 */
#define PIN_PC1B_SMC_A24                           _L_(65)      /**< SMC signal: SMC_A24 on PC1 mux B */
#define MUX_PC1B_SMC_A24                           _L_(1)       /**< SMC signal line function value: SMC_A24 */
#define PIO_PC1B_SMC_A24                           (_U_(1) << 1) /**< SMC signal: SMC_A24 */
#define PIN_PD1C_SMC_A24                           _L_(97)      /**< SMC signal: SMC_A24 on PD1 mux C */
#define MUX_PD1C_SMC_A24                           _L_(2)       /**< SMC signal line function value: SMC_A24 */
#define PIO_PD1C_SMC_A24                           (_U_(1) << 1) /**< SMC signal: SMC_A24 */
#define PIN_PC2B_SMC_A25                           _L_(66)      /**< SMC signal: SMC_A25 on PC2 mux B */
#define MUX_PC2B_SMC_A25                           _L_(1)       /**< SMC signal line function value: SMC_A25 */
#define PIO_PC2B_SMC_A25                           (_U_(1) << 2) /**< SMC signal: SMC_A25 */
#define PIN_PD2C_SMC_A25                           _L_(98)      /**< SMC signal: SMC_A25 on PD2 mux C */
#define MUX_PD2C_SMC_A25                           _L_(2)       /**< SMC signal line function value: SMC_A25 */
#define PIO_PD2C_SMC_A25                           (_U_(1) << 2) /**< SMC signal: SMC_A25 */
#define PIN_PB11B_SMC_A0                           _L_(43)      /**< SMC signal: SMC_A0 on PB11 mux B */
#define MUX_PB11B_SMC_A0                           _L_(1)       /**< SMC signal line function value: SMC_A0 */
#define PIO_PB11B_SMC_A0                           (_U_(1) << 11) /**< SMC signal: SMC_A0 */
#define PIN_PC11F_SMC_A0                           _L_(75)      /**< SMC signal: SMC_A0 on PC11 mux F */
#define MUX_PC11F_SMC_A0                           _L_(5)       /**< SMC signal line function value: SMC_A0 */
#define PIO_PC11F_SMC_A0                           (_U_(1) << 11) /**< SMC signal: SMC_A0 */
#define PIN_PA10F_SMC_A21                          _L_(10)      /**< SMC signal: SMC_A21 on PA10 mux F */
#define MUX_PA10F_SMC_A21                          _L_(5)       /**< SMC signal line function value: SMC_A21 */
#define PIO_PA10F_SMC_A21                          (_U_(1) << 10) /**< SMC signal: SMC_A21 */
#define PIN_PB0B_SMC_A21                           _L_(32)      /**< SMC signal: SMC_A21 on PB0 mux B */
#define MUX_PB0B_SMC_A21                           _L_(1)       /**< SMC signal line function value: SMC_A21 */
#define PIO_PB0B_SMC_A21                           (_U_(1) << 0) /**< SMC signal: SMC_A21 */
